Add architecture diagrams to README, rearranged some sections
